//
//  GeneratedData.swift
//  FileManagerNetology
//
//  Created by Diego Abramoff on 27.07.23.
//

import Foundation

public let filebase: [String] = [
    "birds.jpg", "cat.jpg", "frog.jpg", "horse.jpg", "koala.jpg",
    "frodo.txt", "humor.txt", "hotnews.txt"
]

public let texts: [String: String] = [
    "frodo.txt": """
    Много толков вызвало в Хоббитоне решение господина Бильбо Бэггинса отметить сто одиннадцатую годовщину своего рождения особенно пышным торжеством. Известие это взволновало всех.
    Бильбо был очень богат и известен своими чудачествами; уже шестьдесят лет, после своего памятного исчезновения и неожиданного возвращения, во всем Уделе он был предметом удивления. О богатстве, которое он привез с собой из путешествия, ходило множество местных легенд, и большинство хоббитов верили, что холм под Бэг-Эндом полон туннелей, набитых сокровищами. Но не только эти россказни принесли Бильбо славу; всех восхищали его неиссякаемая бодрость и здоровье. Время шло и шло, но господину Бэггинсу — все нипочем. В девяносто лет он выглядел на пятьдесят. А в девяносто девять стали поговаривать, что он «хорошо сохранился». Хотя, точнее, он не изменился вообще. Многие покачивали головами: не слишком ли много хорошего для одного хоббита — и вечная (стоит лишь на него поглядеть!) молодость, и неисчислимые (как все говорят) богатства.
    — За это придется расплачиваться, — говорили они. — Где такое видано? Тут беды не миновать!
    Но до сих пор никаких бед не приключалось, а поскольку господин Бэггинс отличался щедростью, большинство готовы были простить его причуды и удачливость. Он постоянно приглашал к себе родственников (разумеется, кроме Кошель-Бэггинсов), а те, кто был победнее, его просто обожали. Но близких друзей у него не было, пока не стали подрастать его племянники.
    Старший из них, юный Фродо Бэггинс, был любимцем Бильбо. Когда Бильбо стукнуло девяносто девять лет, он объявил Фродо своим наследником и поселил у себя в Бэг-Энде. Вот тут-то надежды Кошель-Бэггинсов окончательно рухнули.
    Бильбо и Фродо родились в один день — 22 сентября.
    — Перебирайся ко мне, малыш, — сказал однажды Бильбо. — Будем дни рождения вместе праздновать…
    К тому времени Фродо все еще был в возрасте, который хоббиты считают безответственным: между детством и тридцатью тремя годами.

    Прошло еще двенадцать лет. Каждый год Бильбо устраивал в Бэг-Энде праздник по случаю общего дня рождения, но на этот раз все поняли, что на осень намечается нечто исключительное. Бильбо исполнялось сто одиннадцать лет — любопытное число и весьма почтенный возраст для хоббита (сам старый Тукк достиг только ста тридцати), а Фродо стукнуло тридцать три — тоже важное число: дата «вступления в зрелость». По Хоббитону и Приречью заработали языки, и слухи пошли бродить по всему Уделу. Господин Бильбо Бэггинс и его похождения снова стали главной темой пересудов, и старики неожиданно обнаружили, что воспоминания поднялись в цене.
    Ни у кого не было более внимательной аудитории, чем у Хэма Гэмджи, которого все звали попросту Стариком. Он разглагольствовал в «Ветке плюща», трактирчике у Приречного тракта. Говорил он важно и самодовольно — как-никак целых сорок лет он ухаживал за садом в Бэг-Энде, а прежде был там в помощниках у старого Ямкинса. Теперь он и сам состарился, и суставы уже не гнулись, так что работа в основном выполнялась его младшим сыном Сэмом. Отец и сын были дружны с Бильбо и Фродо. Они жили на самом холме, в третьем доме по Бэгшот-Роу, сразу за Бэг-Эндом.
    — Господин Бильбо — очень любезный и разговорчивый, я всегда это говорил, — заявил Старик. И не грешил против истины: Бильбо был всегда очень вежлив с ним, называл его всегда «мастер Хэмфаст» и советовался по поводу выращивания овощей, особенно картофеля — в этом вопросе Старик был признанным знатоком во всей округе.
    — А как насчет этого Фродо, который с ним живет? — спросил старый Нокс из Приречья. — Его фамилия Бэггинс, но говорят, что он наполовину Брендибэк. И с чего это Бэггинсу из Хоббитона взбрело в голову искать жену в Бакленде, где такой странный народ?
    — Неудивительно, что они странные, — тут же вмешался сосед Старика Дэдди Двустоп, — если живут на том берегу Брендивина, прямо под Старым лесом. Это темное место, если в том, что о нем говорят, хотя бы половина правды.
    — В самую точку, — кивнул Старик. — Конечно, Брендибэки из Бакленда не живут в Старом лесу, но все же это странное племя. Взять хотя бы их лодки. Придумали тоже — плавать на них по реке, да еще такой большой! Неудивительно, что оттуда и все неприятности. Ну, это их дело, а господин Фродо — славный юноша, лучшего вам не встретить. Точь-в-точь господин Бэггинс, и не только лицом. В конце концов, его отец тоже был Бэггинс. Очень добропорядочным хоббитом был уважаемый Дрого Бэггинс. О нем вообще ничего нельзя было сказать, пока не утоп.
    """,
    "humor.txt": """
    У генерала родился внук. Чтобы узнать, на кого он похож, генерал посылает в роддом адъютанта. — На вас! — радостно сообщает вернувшийся адъютант. — Вот это да! Докладывай детали! — Внучок ваш лысый, пузатый, ничего не соображает и все время орет.
    
    В отдаленных ракетных гарнизонах служат очень простые парни и понятные инструкции писать не боятся. Например, в одной инструкции ракетной части СибВО была такая запись: "Дежурному оператору запрещается спать положив голову на пульт управления ракетной установкой чтобы слюни из открытого рта не замкнули электрические контакты"
    
    Мои друзья — полицейские служили в милиции, потом в полиции, теперь их переводят в национальную гвардию... Чувствую, на пенсию они уйдут МУШКЕТЁРАМИ.
    
    — Какая первая обязанность солдата на войне?
    — Умереть за свою родину!
    — Неправильно. Первая обязанность солдата — сделать так, чтобы враги умерли за свою родину!
    """,
    "hotnews.txt": """
    @TheIndependentNews:
    "Корова во время транспортировки на бойню сбежала, проломив металлическое ограждение, сломала руку мужчине, доплыла до необитаемого острова, где и живет поныне"
    """
]
